{
  "header": {
    "home": "Home",
    "projects": "Projects",
    "about": "About",
    "contact": "Contact"
  },
  "home": {
    "heroTitle": "Fullstack Developer",
    "heroP": "I build modern web applications using both frontend and backend technologies. I focus on clean code, performance and delivering solutions that truly work.",
    "heroButton": "Featured projects",
    "skills": "Technologies",
    "projectsTitle": "Projects",
    "projectsMore": "More projects"
  },
  "about": {
    "title": "About me",
    "p1": "I am a fullstack developer creating applications that run smoothly and are easy to maintain. I enjoy building new projects and continuously improving my code with each new challenge.",
    "p2": "I have solid knowledge of JavaScript, TypeScript, SCSS, React, and C++, as well as many other technologies and methodologies. I focus on creating intuitive interfaces and optimizing performance.",
    "p3": "I care about clean architecture and am not afraid to revisit older projects to refactor and enhance them. This allows me to continuously develop my skills and gain practical experience.",
    "strengths": "My strengths",
    "items": {
      "automation": {
        "title": "Work automation",
        "description": "I can create tools and scripts that save time and minimize repetitive tasks."
      },
      "perseverance": {
        "title": "Perseverance and patience",
        "description": "I consistently see projects through to completion, even when facing difficult challenges."
      },
      "creativity": {
        "title": "Creativity and resourcefulness",
        "description": "I find unconventional solutions to complex problems."
      },
      "focus": {
        "title": "Focus on results",
        "description": "I turn ideas into working projects, not just concepts on paper."
      }
    },
    "occ": "Fullstack Developer"
  },
  "projects": {
    "title": "Projects",
    "ImageInary": {
      "description": "A web application for searching images that allows users to quickly browse photos based on a query. Users can view results, open selected images in a modal, and load more pages.",
      "descriptionLong": "A web project that enables image searching using an external API. Users can enter search queries, browse results in a gallery, and preview selected images in a modal view. The application supports pagination and dynamic data loading, providing a smooth user experience. The project demonstrates asynchronous JavaScript, API integration, React state management, and the creation of an interactive and responsive user interface."
    },
    "raportGeneratorV2": {
      "description": "A web application designed for quickly generating clear and structured reports from mock high school graduation exams. The project focuses on simplifying the report creation process, improving data readability, and delivering a modern user interface.",
      "descriptionLong": "This web application generates reports from mock high school graduation exams and is a refactored version of an earlier tool. The goal was to reorganize logic, improve architecture, and design a clearer interface. It enables fast exam data processing and structured reports, reducing documentation time. Version V2 focuses on UX, modular code, and a solid base for future development. The project demonstrates refactoring and structured frontend architecture."
    },
    "filmoteka": {
      "description": "A web application with a movie search engine that allows users to browse popular and top-rated films and quickly find specific titles. Users can check detailed information such as descriptions, ratings, and rankings.",
      "descriptionLong": "A web project with a movie search engine and popularity rankings. Users can browse trending films and search for specific titles. Each movie includes details such as description, ratings, genre, and other data. The project demonstrates external API integration, interactive UI development, and responsive design. Filmoteka combines aesthetics with effective search and filtering features."
    },
    "formularzZjazdSLO": {
      "description": "A web-based registration form enabling alumni to sign up for a reunion of the Social High School in Żary. The public section allows submissions, and data is stored in Supabase for easy management and verification.",
      "descriptionLong": "A web project streamlining registration for the Social High School reunion in Żary. It includes a public form for participants and an administrative view for managing data. Information is securely stored in Supabase, ensuring accessibility and processing. The project demonstrates responsive form development, cloud database integration, and structuring solutions for both users and administrators."
    },
    "anemone": {
      "description": "Anemone is a website created for a flower shop, showcasing plants and floral arrangements while allowing users to browse available products in a visually appealing way.",
      "descriptionLong": "Anemone is a website for a flower shop that allows users to browse plants and floral products. It combines aesthetic design with clear structure and responsive layout, enabling quick exploration of the offer. The project demonstrates business website development, product organization, visual integration, and user-focused experience."
    },
    "goit": {
      "description": "A website presenting the services of a web studio, including project portfolio and client offerings. The page combines an aesthetic interface with a clear content structure, allowing visitors to quickly understand the studio’s offer.",
      "descriptionLong": "Web project presenting a website for a web studio, showcasing services and portfolio. Users can explore the offer, review projects, and easily find contact details. The project focuses on visual aesthetics, clear content structure, and responsive design. It demonstrates skills in building structured one-page sites, integrating graphics and animations, and creating a user-friendly experience."
    },
    "flippingCard": {
      "description": "Flipping Card is an interactive UI component that presents a 3D card flip effect used to display additional information in a visually engaging way. The project focuses on CSS animations, responsiveness, and smooth user interactions.",
      "descriptionLong": "Flipping Card is an interactive UI component that presents a 3D card flip effect used to display additional information in a visually engaging way. The project focuses on CSS animations, responsiveness, and smooth user interactions."
    }
  },
  "contact": {
    "title": "Contact"
  }
}
