{
  "header": {
    "home": "Strona główna",
    "projects": "Projekty",
    "about": "O mnie",
    "contact": "Kontakt"
  },
  "home": {
    "heroTitle": "Deweloper Fullstack",
    "heroP": "Buduję nowoczesne aplikacje webowe w oparciu o technologie frontendowe i backendowe. Skupiam się na czystym kodzie, wydajności i tworzeniu rozwiązań, które realnie działają.",
    "heroButton": "Główne projekty",
    "skills": "Technologie",
    "projectsTitle": "Projekty",
    "projectsMore": "Inne projekty"
  },
  "about": {
    "title": "O mnie",
    "p1": "Jestem fullstack developerem, tworzącym aplikacje, które działają sprawnie i są łatwe w utrzymaniu. Lubię budować nowe projekty i z każdą kolejną próbą udoskonalać swój kod.",
    "p2": "Posiadam ugruntowaną wiedzę w JavaScript, TypeScript, SCSS, React i C++, a także w wielu innych technologiach i metodach. Skupiam się na tworzeniu intuicyjnych interfejsów i optymalizacji wydajności.",
    "p3": "Dbam o czystą architekturę i nie boję się wracać do starszych projektów, aby je refaktoryzować i udoskonalać. Dzięki temu stale rozwijam swoje umiejętności i zdobywam doświadczenie w praktyce.",
    "strengths": "Moje silne strony",
    "items": {
      "automation": {
        "title": "Automatyzacja pracy",
        "description": "Potrafię tworzyć narzędzia i skrypty, które oszczędzają czas i minimalizują powtarzalne zadania."
      },
      "perseverance": {
        "title": "Wytrwałość i cierpliwość",
        "description": "Konsekwentnie doprowadzam projekty do końca, nawet przy trudnych wyzwaniach."
      },
      "creativity": {
        "title": "Kreatywność i pomysłowość",
        "description": "Znajduję nietypowe rozwiązania dla złożonych problemów."
      },
      "focus": {
        "title": "Skupienie na efektach",
        "description": "Realizuję pomysły w działających projektach, nie tylko na papierze."
      }
    },
    "occ": "Deweloper Fullstack"
  },
  "projects": {
    "title": "Projekty",
    "raportGeneratorV2": {
      "description": "Jest to aplikacja webowa służąca do szybkiego tworzenia czytelnych raportów z próbnych egzaminów maturalnych. Projekt skupia się na uproszczeniu procesu generowania zestawień, poprawie czytelności danych oraz nowoczesnym interfejsie użytkownika.",
      "descriptionLong": "Jest to webowa aplikacja wspierająca proces tworzenia raportów z próbnych egzaminów maturalnych, zaprojektowana jako rozwinięcie i refaktoryzacja wcześniejszej wersji narzędzia. Głównym celem projektu było uporządkowanie logiki aplikacji, poprawa architektury kodu oraz stworzenie bardziej przejrzystego i intuicyjnego interfejsu. Aplikacja umożliwia szybkie przetwarzanie danych egzaminacyjnych i generowanie raportów w formie czytelnych zestawień, co znacząco skraca czas pracy z dokumentacją. Wersja V2 kładzie nacisk na lepszy UX, modularność kodu oraz przygotowanie solidnej bazy pod dalszy rozwój funkcjonalności. Projekt pokazuje umiejętność pracy z istniejącym kodem, refaktoryzacji oraz świadomego podejścia do struktury aplikacji frontendowej."
    },
    "filmoteka": {
      "description": "Strona webowa z wyszukiwarką filmów, która umożliwia przeglądanie popularnych i wysoko ocenianych produkcji oraz szybkie znalezienie konkretnego filmu. Użytkownik może sprawdzić szczegóły, takie jak opis, oceny i ranking filmów.",
      "descriptionLong": "Projekt webowy prezentujący wyszukiwarkę filmów z rankingiem popularności i ocen. Aplikacja pozwala użytkownikowi przeglądać najnowsze i najchętniej oglądane filmy oraz wyszukiwać konkretne produkcje po tytule. Dla każdego filmu wyświetlane są szczegółowe informacje, w tym opis, oceny, gatunek i inne istotne dane. Projekt pokazuje umiejętność integracji z zewnętrznymi źródłami danych (API filmowe), tworzenia interaktywnego UI oraz budowania responsywnych stron umożliwiających użytkownikowi szybki dostęp do informacji. Filmoteka łączy estetykę interfejsu z funkcjonalnością wyszukiwarki i filtrowania danych, co czyni ją projektem praktycznym i atrakcyjnym dla użytkownika."
    },
    "formularzZjazdSLO": {
      "description": "Strona-formularz umożliwiająca zapis na zjazd absolwentów Społecznego Liceum w Żarach. Publiczna część pozwala dokonywać zapisów, a dane są przechowywane w Supabase, co umożliwia ich łatwe zarządzanie i weryfikację.",
      "descriptionLong": "Projekt webowy w formie strony-formularza, stworzony w celu usprawnienia rejestracji uczestników zjazdu absolwentów Społecznego Liceum w Żarach. Aplikacja składa się z dwóch głównych sekcji: publicznej strony umożliwiającej zapis uczestników oraz panelu do odczytu i przeglądania zgromadzonych danych. Dane są bezpiecznie przechowywane w Supabase, co zapewnia prosty dostęp i możliwość dalszego przetwarzania. Projekt pokazuje umiejętność tworzenia responsywnych formularzy, integracji z bazą danych w chmurze oraz organizacji struktury strony pod potrzeby użytkowników i administratorów."
    },
    "anemone": {
      "description": "Anemone to strona internetowa dla kwiaciarni prezentująca ofertę roślin i kompozycji kwiatowych oraz umożliwiająca przeglądanie dostępnych produktów w atrakcyjny wizualnie sposób.",
      "descriptionLong": "Anemone to projekt webowy stworzony dla kwiaciarni, który umożliwia użytkownikom przeglądanie oferty roślin, kompozycji kwiatowych oraz produktów dostępnych w sklepie. Strona łączy estetyczny design z przejrzystym układem treści i responsywnym interfejsem, pozwalając klientom szybko zapoznać się z ofertą. Projekt pokazuje umiejętność tworzenia stron prezentacyjnych dla biznesu, organizowania sekcji produktowych, integracji grafiki i zapewnienia przyjaznego doświadczenia użytkownika."
    },
    "goit": {
      "description": "To strona internetowa prezentująca usługi studia webowego, w tym portfolio projektów i ofertę dla klientów. Strona łączy estetyczny interfejs z przejrzystym układem treści, umożliwiając szybkie zapoznanie się z ofertą studia.",
      "descriptionLong": "Projekt webowy, który przedstawia kompleksową stronę prezentującą usługi i portfolio studia webowego. Aplikacja pozwala użytkownikowi zapoznać się z ofertą studia, obejrzeć przykładowe realizacje oraz łatwo znaleźć informacje kontaktowe. Projekt kładzie nacisk na estetykę interfejsu, czytelny układ treści oraz responsywność strony. Pokazuje umiejętność budowania stron typu \"one-page\" z wyraźnym podziałem sekcji, integracji grafiki i animacji oraz tworzenia przyjaznego UX dla potencjalnych klientów lub użytkowników odwiedzających stronę."
    },
    "flippingCard": {
      "description": "Flipping Card to interaktywny komponent UI prezentujący efekt odwracania karty w 3D, wykorzystywany do wyświetlania dodatkowych informacji w atrakcyjny wizualnie sposób. Projekt skupia się na animacjach CSS, responsywności oraz płynnych interakcjach użytkownika.",
      "descriptionLong": "Flipping Card to interaktywny komponent UI prezentujący efekt odwracania karty w 3D, wykorzystywany do wyświetlania dodatkowych informacji w atrakcyjny wizualnie sposób. Projekt skupia się na animacjach CSS, responsywności oraz płynnych interakcjach użytkownika."
    }
  },
  "contact": {
    "title": "Kontakt"
  }
}
