{
  "header": {
    "home": "Strona główna",
    "projects": "Projekty",
    "about": "O mnie",
    "contact": "Kontakt"
  },
  "home": {
    "heroTitle": "Deweloper Fullstack",
    "heroP": "Buduję nowoczesne aplikacje webowe w oparciu o technologie frontendowe i backendowe. Skupiam się na czystym kodzie, wydajności i tworzeniu rozwiązań, które realnie działają.",
    "heroButton": "Główne projekty",
    "skills": "Technologie",
    "projectsTitle": "Projekty",
    "projectsMore": "Inne projekty"
  },
  "about": {
    "title": "O mnie",
    "p1": "Jestem fullstack developerem, tworzącym aplikacje, które działają sprawnie i są łatwe w utrzymaniu. Lubię budować nowe projekty i z każdą kolejną próbą udoskonalać swój kod.",
    "p2": "Posiadam ugruntowaną wiedzę w JavaScript, TypeScript, SCSS, React i C++, a także w wielu innych technologiach i metodach. Skupiam się na tworzeniu intuicyjnych interfejsów i optymalizacji wydajności.",
    "p3": "Dbam o czystą architekturę i nie boję się wracać do starszych projektów, aby je refaktoryzować i udoskonalać. Dzięki temu stale rozwijam swoje umiejętności i zdobywam doświadczenie w praktyce.",
    "strengths": "Moje silne strony",
    "items": {
      "automation": {
        "title": "Automatyzacja pracy",
        "description": "Potrafię tworzyć narzędzia i skrypty, które oszczędzają czas i minimalizują powtarzalne zadania."
      },
      "perseverance": {
        "title": "Wytrwałość i cierpliwość",
        "description": "Konsekwentnie doprowadzam projekty do końca, nawet przy trudnych wyzwaniach."
      },
      "creativity": {
        "title": "Kreatywność i pomysłowość",
        "description": "Znajduję nietypowe rozwiązania dla złożonych problemów."
      },
      "focus": {
        "title": "Skupienie na efektach",
        "description": "Realizuję pomysły w działających projektach, nie tylko na papierze."
      }
    },
    "occ": "Deweloper Fullstack"
  },
  "projects": {
    "title": "Projekty",
    "ImageInary": {
      "description": "Aplikacja webowa do wyszukiwania obrazów, która umożliwia szybkie przeglądanie zdjęć na podstawie wpisanego zapytania. Użytkownik może wyświetlać wyniki, powiększać wybrane obrazy oraz ładować kolejne strony.",
      "descriptionLong": "Projekt webowy umożliwiający wyszukiwanie obrazów z wykorzystaniem zewnętrznego API. Użytkownik może wpisywać zapytania, przeglądać wyniki w formie galerii oraz wyświetlać wybrane zdjęcia w trybie podglądu. Aplikacja obsługuje paginację i dynamiczne ładowanie danych, zapewniając płynne doświadczenie użytkownika. Projekt prezentuje pracę z asynchronicznym JavaScript, integrację z API, zarządzanie stanem w React oraz tworzenie interaktywnego i responsywnego interfejsu."
    },
    "raportGeneratorV2": {
      "description": "Jest to aplikacja webowa służąca do szybkiego tworzenia czytelnych raportów z próbnych egzaminów maturalnych. Projekt skupia się na uproszczeniu procesu generowania zestawień, poprawie czytelności danych oraz nowoczesnym interfejsie użytkownika.",
      "descriptionLong": "Jest to webowa aplikacja do tworzenia raportów z próbnych egzaminów maturalnych, będąca rozwinięciem i refaktoryzacją wcześniejszej wersji. Celem było uporządkowanie logiki, poprawa architektury i stworzenie bardziej intuicyjnego interfejsu. Umożliwia szybkie przetwarzanie danych oraz generowanie czytelnych zestawień, skracając czas pracy. Wersja V2 skupia się na lepszym UX, modularności i solidnej bazie pod dalszy rozwój. Projekt pokazuje pracę z istniejącym kodem i świadome podejście do struktury aplikacji frontendowej."
    },
    "filmoteka": {
      "description": "Strona webowa z wyszukiwarką filmów, która umożliwia przeglądanie popularnych i wysoko ocenianych produkcji oraz szybkie znalezienie konkretnego filmu. Użytkownik może sprawdzić szczegóły, takie jak opis, oceny i ranking filmów.",
      "descriptionLong": "Projekt webowy z wyszukiwarką filmów i rankingiem popularności oraz ocen. Użytkownik może przeglądać najnowsze i popularne produkcje oraz wyszukiwać konkretne tytuły. Każdy film zawiera szczegółowe informacje, takie jak opis, oceny, gatunek i inne dane. Projekt pokazuje integrację z zewnętrznym API, tworzenie interaktywnego UI oraz responsywnych widoków. Filmoteka łączy estetykę z funkcjonalnym wyszukiwaniem i filtrowaniem."
    },
    "formularzZjazdSLO": {
      "description": "Strona-formularz umożliwiająca zapis na zjazd absolwentów Społecznego Liceum w Żarach. Publiczna część pozwala dokonywać zapisów, a dane są przechowywane w Supabase, co umożliwia ich łatwe zarządzanie i weryfikację.",
      "descriptionLong": "Projekt webowy usprawniający rejestrację uczestników zjazdu absolwentów Społecznego Liceum w Żarach. Aplikacja zawiera publiczny formularz zapisów oraz panel do przeglądania danych. Informacje przechowywane są w Supabase, co zapewnia łatwy dostęp i dalsze przetwarzanie. Projekt pokazuje tworzenie responsywnych formularzy, integrację z bazą w chmurze oraz dopasowanie struktury do potrzeb użytkowników i administratorów."
    },
    "anemone": {
      "description": "Anemone to strona internetowa dla kwiaciarni prezentująca ofertę roślin i kompozycji kwiatowych oraz umożliwiająca przeglądanie dostępnych produktów w atrakcyjny wizualnie sposób.",
      "descriptionLong": "Anemone to projekt strony dla kwiaciarni umożliwiający przeglądanie roślin, kompozycji i produktów. Strona łączy estetyczny design z przejrzystym układem i responsywnym interfejsem, ułatwiając zapoznanie się z ofertą. Projekt pokazuje tworzenie stron biznesowych, organizację sekcji produktowych, integrację grafiki i budowanie przyjaznego doświadczenia użytkownika."
    },
    "goit": {
      "description": "To strona internetowa prezentująca usługi studia webowego, w tym portfolio projektów i ofertę dla klientów. Strona łączy estetyczny interfejs z przejrzystym układem treści, umożliwiając szybkie zapoznanie się z ofertą studia.",
      "descriptionLong": "Projekt webowy prezentujący stronę studia webowego z ofertą i portfolio. Użytkownik może zapoznać się z usługami, obejrzeć realizacje oraz łatwo znaleźć kontakt. Projekt stawia na estetyczny interfejs, czytelny układ i responsywność. Pokazuje umiejętność tworzenia stron typu 'one-page' z wyraźnymi sekcjami, integracją grafiki i animacji oraz budowaniem przyjaznego UX."
    },
    "flippingCard": {
      "description": "Flipping Card to interaktywny komponent UI prezentujący efekt odwracania karty w 3D, wykorzystywany do wyświetlania dodatkowych informacji w atrakcyjny wizualnie sposób. Projekt skupia się na animacjach CSS, responsywności oraz płynnych interakcjach użytkownika.",
      "descriptionLong": "Flipping Card to interaktywny komponent UI prezentujący efekt odwracania karty w 3D, wykorzystywany do wyświetlania dodatkowych informacji w atrakcyjny wizualnie sposób. Projekt skupia się na animacjach CSS, responsywności oraz płynnych interakcjach użytkownika."
    }
  },
  "contact": {
    "title": "Kontakt"
  }
}
